DataProcessors/АРМ_ПунктВыдачиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМ_ПунктВыдачиЗаказа</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/МаркируемыеТоварыВЗаказеКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>МаркируемыеТоварыВЗаказеКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШтрихкодУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОформленияПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОформленияПродажи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОперацияПоПлатежнойКарте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОперацияПоПлатежнойКарте</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорЭквайринга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОплатыСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанкСБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПлатежнойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОснованиеПлатежа</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПогашения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВалютаВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОбъектРасчетов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КурсЧислительВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/АРМ_ПунктВыдачиЗаказа/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаказКлиентаСсылка = Параметры.ЗаказКлиента;
	Организация = ОрганизацияЗаказа();
	ОсталосьОплатить = ПолучитьСуммуПредоплат();
	Элементы.ДекорацияСуммаЗаказа.Заголовок = СтрШаблон("Сумма заказа: %1 руб.", СуммаЗаказа());
	ДанныеПоУмолчанию = ПолучитьДанныеДляЗаполнения();
	Касса = ДанныеПоУмолчанию.Касса;
	КассаККМ = ДанныеПоУмолчанию.КассаККМ;
	МассивЭТ = ДанныеПоУмолчанию.ЭквайринговыйТерминал;
	
	Элементы.ЭквайринговыйТерминал.СписокВыбора.ЗагрузитьЗначения(МассивЭТ);
	
	Если МассивЭТ.Количество() = 0 Тогда
		Элементы.ЭквайринговыйТерминал.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	СуммаБезналичные = 50000;
	Последние4Цифры = "1123";
	
	ОбновитьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура СуммаНаличныеПриИзменении(Элемент)
	
	Если ЕстьОшибкиВводаСумм() Тогда
		ПоказатьПредупреждение(, "Проверьте правильность ввода сумм",,"BABOCHKA");
	КонецЕсли;

	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаБезналичныеПриИзменении(Элемент)
	
	Если ЕстьОшибкиВводаСумм() Тогда
		ПоказатьПредупреждение(, "Проверьте правильность ввода сумм",,"BABOCHKA");
	КонецЕсли;
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЦепочкуДокументов(Команда)
	
	СтруктураВозврата = СоздатьЦепочкуДокументовНаСервере();
	
	Если СтруктураВозврата.Свойство("РеализацияТоваровУслуг") И ЗначениеЗаполнено(СтруктураВозврата.РеализацияТоваровУслуг) Тогда
		ОткрытьЗначение(СтруктураВозврата.РеализацияТоваровУслуг);
	КонецЕсли;
	
	Если СтруктураВозврата.Свойство("Оплаты") И СтруктураВозврата.Оплаты <> Неопределено Тогда
		Для Каждого ДокОплаты Из СтруктураВозврата.Оплаты Цикл
			ОткрытьЗначение(ДокОплаты);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьВидимостьЭлементов()
	
	Элементы.СоздатьЦепочкуДокументов.Доступность = СуммаБезналичные + СуммаНаличные = ОсталосьОплатить;
	Элементы.Последние4Цифры.Видимость = СуммаБезналичные > 0;
	Элементы.ЭквайринговыйТерминал.Видимость = СуммаБезналичные > 0;
	Элементы.Касса.Видимость = Не ЗначениеЗаполнено(Касса) ИЛИ Элементы.Касса.Видимость;
	Элементы.КассаККМ.Видимость = Не ЗначениеЗаполнено(КассаККМ) ИЛИ Элементы.КассаККМ.Видимость;
	
КонецПроцедуры



Функция СоздатьЦепочкуДокументовНаСервере()
	
	СтруктураВозврата = Новый Структура;
	
	Ошибки = Новый Массив;
	Оплаты = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		Если НЕ ОтгрузитьСтрокиЗаказа(ЗаказКлиентаСсылка) Тогда
			ВызватьИсключение "Не удалось отгрузить строки заказа. Попробуйте вручную.";
		КонецЕсли;

		Если СуммаНаличные > 0 Тогда
			
			РезультатОплатыНаличными = СоздатьПриходныйКассовыйОрдер(ЗаказКлиентаСсылка, СуммаНаличные);
			
			Если РезультатОплатыНаличными.Свойство("ОписаниеОшибки") Тогда
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("Error", Истина);
				СтруктураОшибки.Вставить("Description", "Приходный кассовый ордер. "+РезультатОплатыНаличными.ОписаниеОшибки);
				
				Ошибки.Добавить(СтруктураОшибки);
			КонецЕсли;
			
			Оплаты.Добавить(РезультатОплатыНаличными.ПриходныйКассовыйОрдер);
			
		КонецЕсли;

		Если СуммаБезналичные > 0 Тогда
			
			РезультатОплатыКартой = СоздатьЭквайринговуюОперацию(ЗаказКлиентаСсылка, СуммаБезналичные, Последние4Цифры);
			
			Если РезультатОплатыКартой.Свойство("ОписаниеОшибки") Тогда
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("Error", Истина);
				СтруктураОшибки.Вставить("Description", "Эквайринговая операция. "+РезультатОплатыКартой.ОписаниеОшибки);
				
				Ошибки.Добавить(СтруктураОшибки); 
			КонецЕсли;
			
			Оплаты.Добавить(РезультатОплатыКартой.ЭквайринговаяОперация);
			
		КонецЕсли;

		РезультатРеализацииТоваров = СоздатьРеализациюТоваров(ЗаказКлиентаСсылка);
		
		Если РезультатРеализацииТоваров.Свойство("ОписаниеОшибки") Тогда
			
			СтруктураОшибки = Новый Структура;
			СтруктураОшибки.Вставить("Error", Истина);
			СтруктураОшибки.Вставить("Description", "Реализация товаров и услуг. "+РезультатРеализацииТоваров.ОписаниеОшибки);
			
			Ошибки.Добавить(СтруктураОшибки);
			
		КонецЕсли;
		
		Если РезультатРеализацииТоваров.Свойство("РеализацияТоваровУслуг") 
			И ЗначениеЗаполнено(РезультатРеализацииТоваров.РеализацияТоваровУслуг) Тогда
			
			РеализацияТоваровУслуг = РезультатРеализацииТоваров.РеализацияТоваровУслуг;
			
		КонецЕсли;
		Если Ошибки.Количество() > 0 Тогда
			BG_Telegram.ОтправитьСообщениеВТелеграм(Строка(ЗаказКлиентаСсылка)+Символы.ПС+Ошибки[0].Description, "745986791");
			ВызватьИсключение Ошибки[0].Description;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		СтруктураВозврата.Вставить("Оплаты", Новый Массив);
		СтруктураВозврата.Вставить("РеализацияТоваровУслуг", Неопределено);
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.Вставить("Оплаты", Оплаты);
	СтруктураВозврата.Вставить("РеализацияТоваровУслуг", РеализацияТоваровУслуг);

	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтгрузитьСтрокиЗаказа(ЗаказСсылка)
	
	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	ЕстьСтрокиКОтгрузке = Ложь;
	ТребуетсяЗапись = Ложь;
			
	Для каждого СтрокаТоваров Из ЗаказОбъект.Товары Цикл
		
		Если СтрокаТоваров.Отменено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТоваров.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда
			
			ЕстьСтрокиКОтгрузке = Истина;
			СтрокаТоваров.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
			СтрокаТоваров.ДатаОтгрузки = ТекущаяДатаСеанса();
			ТребуетсяЗапись = Истина;
			
		ИначеЕсли СтрокаТоваров.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить Тогда
			
			ЕстьСтрокиКОтгрузке = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяЗапись Тогда
		
		Попытка
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Возврат Истина;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ЕстьСтрокиКОтгрузке;
	
КонецФункции

Функция СоздатьРеализациюТоваров(ЗаказСсылка)
	
	Результат = Новый Структура;
	
	ДокументРТиУ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	ДокументРТиУ.Дата = ТекущаяДатаСеанса();
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ДокументОснование"		, ЗаказСсылка);
	ДанныеЗаполнения.Вставить("ВариантОформленияПродажи", Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
	ДанныеЗаполнения.Вставить("СкладОтгрузки"			, Неопределено);
	
	ДокументРТиУ.Заполнить(ДанныеЗаполнения);
	
	Если ДокументРТиУ.Товары.Количество() = 0 Тогда
		Результат.Вставить("ОписаниеОшибки", "Нет товаров к отгрузке");
		Возврат Результат;	
	КонецЕсли;
	
	//маркировка
	МассивШтрихкодовУпаковок = Новый Массив;
	Для Каждого СтрокаТЧ из ДокументРТиУ.Товары Цикл
		
		//обувь
		Если СтрокаТЧ.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ОбувнаяПродукция Тогда

			//меховые изделия	
		ИначеЕсли СтрокаТЧ.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.КиЗГИСМ Тогда
			
			СерияНоменклатуры = НайтиСериюНоменклатуры(ЗаказСсылка, СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, МассивШтрихкодовУпаковок);
			Если СерияНоменклатуры <> Неопределено Тогда
				
				НоваяСтрока = ДокументРТиУ.Серии.Добавить();
				НоваяСтрока.Серия 			= СерияНоменклатуры;
				НоваяСтрока.Номенклатура 	= СтрокаТЧ.Номенклатура;
				НоваяСтрока.Характеристика 	= СтрокаТЧ.Характеристика;
				МассивШтрихкодовУпаковок.Добавить(СерияНоменклатуры);
				НоваяСтрока.Количество 		= 1;
				НоваяСтрока.Склад 			= ДокументРТиУ.Склад;
				//Назначение
			КонецЕсли;

		КонецЕсли;
		
	КонецЦикла;  
	
	ПараметрыРасчетаСкидок = СкидкиНаценкиЗаполнениеСервер.НовыйПараметрыРассчитать();
	ПараметрыРасчетаСкидок.ЗаполнитьРеализациюПоЗаказу = Истина;
	
	СкидкиНаценкиСервер.Рассчитать(ДокументРТиУ, ПараметрыРасчетаСкидок);
	
	Попытка
		ДокументРТиУ.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Результат.Вставить("РеализацияТоваровУслуг", ДокументРТиУ.Ссылка);
	
	Попытка
		ДокументРТиУ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьПриходныйКассовыйОрдер(ЗаказСсылка, СуммаОплаты)
	
	Результат = Новый Структура;
	
	ДокументПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументПКО.Дата = ТекущаяДатаСеанса();
	
	ДокументПКО.Заполнить(ЗаказСсылка);
	
	ДокументПКО.СуммаДокумента = СуммаОплаты;
	
	ДокументПКО.Касса 		= Касса;
	ДокументПКО.КассаККМ 	= КассаККМ;
	
	Если ДокументПКО.РасшифровкаПлатежа.Количество() = 1 Тогда
		
		ДокументПКО.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		ДокументПКО.РасшифровкаПлатежа[0].Сумма = СуммаОплаты;
		
	Иначе
		
		НомерСтроки = ДокументПКО.РасшифровкаПлатежа.Количество() - 1;
		Пока НомерСтроки >= 0 Цикл
			
			СтрокаРасшифровки = ДокументПКО.РасшифровкаПлатежа[НомерСтроки];
			СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		
			Если СтрокаРасшифровки.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				
				Сумма = ПолучитьСуммуНДС10(ЗаказСсылка);
				СтрокаРасшифровки.Сумма = Сумма;   
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки - 1;
			
		КонецЦикла;

	КонецЕсли;
	
	Попытка
		ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(ДокументПКО, ДокументПКО.СуммаДокумента, Ложь);
		ПараметрыПересчетаНДС 	= Новый Структура("ЦенаВключаетНДС", Истина);
		СтруктураДействий 		= Новый Структура("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументПКО.РасшифровкаПлатежа, СтруктураДействий, Неопределено);
		ДокументПКО.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Результат.Вставить("ПриходныйКассовыйОрдер", ДокументПКО.Ссылка);
	
	Попытка
		ДокументПКО.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьЭквайринговуюОперацию(ЗаказСсылка, СуммаОплаты, LastFourDigits)
	
	Результат = Новый Структура;
	
	ДокументЭквайринговаяОперация = Документы.ОперацияПоПлатежнойКарте.СоздатьДокумент();
	ДокументЭквайринговаяОперация.Дата = ТекущаяДатаСеанса();
	
	ДокументЭквайринговаяОперация.Заполнить(ЗаказСсылка);
	
	ДокументЭквайринговаяОперация.Подразделение = ЗаказСсылка.Подразделение;
	ДокументЭквайринговаяОперация.СуммаДокумента = СуммаОплаты;
	
	Если ДокументЭквайринговаяОперация.РасшифровкаПлатежа.Количество() = 1 Тогда
		
		ДокументЭквайринговаяОперация.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		ДокументЭквайринговаяОперация.РасшифровкаПлатежа[0].Сумма = СуммаОплаты;
		//ДокументЭквайринговаяОперация.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаОплаты;
		
	Иначе
		
		НомерСтроки = ДокументЭквайринговаяОперация.РасшифровкаПлатежа.Количество() - 1;
		Пока НомерСтроки >= 0 Цикл
			
			СтрокаРасшифровки = ДокументЭквайринговаяОперация.РасшифровкаПлатежа[НомерСтроки];
			СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента;
		
			Если СтрокаРасшифровки.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
				
				Сумма = ПолучитьСуммуНДС10(ЗаказСсылка);
				СтрокаРасшифровки.Сумма = Сумма;
				//СтрокаРасшифровки.СуммаВзаиморасчетов = Сумма;
				
			КонецЕсли;
			
			НомерСтроки = НомерСтроки - 1;
			
		КонецЦикла;

	КонецЕсли;
	
	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(ДокументЭквайринговаяОперация, ДокументЭквайринговаяОперация.СуммаДокумента, Ложь);
	ПараметрыПересчетаНДС 	= Новый Структура("ЦенаВключаетНДС", Истина);
	СтруктураДействий 		= Новый Структура("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ДокументЭквайринговаяОперация.РасшифровкаПлатежа, СтруктураДействий, Неопределено);
	ДокументЭквайринговаяОперация.НомерПлатежнойКарты 	= LastFourDigits;
	
	Попытка
		ДокументЭквайринговаяОперация.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
		Возврат Результат;
	КонецПопытки;
	
	Результат.Вставить("ЭквайринговаяОперация", ДокументЭквайринговаяОперация.Ссылка);
	
	Попытка
		ДокументЭквайринговаяОперация.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Результат.Вставить("ОписаниеОшибки", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

Функция НайтиСериюНоменклатуры(ЗаказСсылка, Номенклатура, Характеристика, МассивСерий)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркируемыеТоварыВЗаказеКлиента.Серия КАК Серия
		|ИЗ
		|	РегистрСведений.МаркируемыеТоварыВЗаказеКлиента КАК МаркируемыеТоварыВЗаказеКлиента
		|ГДЕ
		|	МаркируемыеТоварыВЗаказеКлиента.ЗаказКлиента = &ЗаказКлиента
		|	И МаркируемыеТоварыВЗаказеКлиента.Номенклатура = &Номенклатура
		|	И МаркируемыеТоварыВЗаказеКлиента.Характеристика = &Характеристика
		|	И НЕ МаркируемыеТоварыВЗаказеКлиента.Серия В (&МассивСерий)";
		
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказСсылка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Запрос.УстановитьПараметр("МассивСерий", МассивСерий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Серия;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполнения()
	
	Данные = Новый Структура("Касса, КассаККМ, ЭквайринговыйТерминал");
		
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРМККассы.Касса КАК Касса
		|ИЗ
		|	Справочник.НастройкиРМК.Кассы КАК НастройкиРМККассы
		|ГДЕ
		|	НастройкиРМККассы.Ссылка.РабочееМесто = &РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиРМККассыККМ.КассаККМ КАК КассаККМ
		|ИЗ
		|	Справочник.НастройкиРМК.КассыККМ КАК НастройкиРМККассыККМ
		|ГДЕ
		|	НастройкиРМККассыККМ.Ссылка.РабочееМесто = &РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	Справочник.НастройкиРМК.ЭквайринговыеТерминалы КАК НастройкиРМКЭквайринговыеТерминалы
		|ГДЕ
		|	НастройкиРМКЭквайринговыеТерминалы.Ссылка.РабочееМесто = &РабочееМесто";
	
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	ВыборкаПоКассам = Пакеты[0].Выбрать();
	
	Если ВыборкаПоКассам.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Данные, ВыборкаПоКассам, "Касса");
	КонецЕсли;
	
	ВыборкаПоКассамККМ = Пакеты[1].Выбрать();
	
	Если ВыборкаПоКассамККМ.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Данные, ВыборкаПоКассамККМ, "КассаККМ");
	КонецЕсли;
	
	ТЧЭквайринговыеТерминалы = Пакеты[2].Выгрузить();
	
	Если ТЧЭквайринговыеТерминалы.Количество() > 0 Тогда
		Данные.ЭквайринговыйТерминал = ТЧЭквайринговыеТерминалы.ВыгрузитьКолонку("ЭквайринговыйТерминал");
	Иначе
		Данные.ЭквайринговыйТерминал = Новый Массив;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСуммуНДС10(Заказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаказКлиентаТовары.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ
		|	И ЗаказКлиентаТовары.СтавкаНДС = &СтавкаНДС
		|	И НЕ ЗаказКлиентаТовары.Отменено";
	
	Запрос.УстановитьПараметр("Заказ"	 , Заказ);
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.НДС10);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Сумма;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЕстьОшибкиВводаСумм()
	
	Возврат СуммаБезналичные + СуммаНаличные <> ОсталосьОплатить;
	
КонецФункции

Функция ОрганизацияЗаказа()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиентаСсылка, "Организация")	
КонецФункции
Функция СуммаЗаказа()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаказКлиентаСсылка, "СуммаДокумента")	
КонецФункции
Функция ПолучитьСуммуПредоплат()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСКлиентамиОстатки.КОплатеОстаток КАК КОплатеОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ОбъектРасчетов.Объект = &ЗаказКлиента) КАК РасчетыСКлиентамиОстатки";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиентаСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КОплатеОстаток;
	КонецЕсли;
		
КонецФункции
